artifacts/packs/lumped_solid_case_only_20260330_111000/lumped_solid/constant/cap/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/cap/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    externalWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4056;
        startFace       42632;
    }
    cap_to_jellyRoll
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1160;
        startFace       46688;
        sampleMode      nearestPatchFace;
        sampleRegion    jellyRoll;
        samplePatch     jellyRoll_to_cap;
    }
    cap_to_shell
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          236;
        startFace       47848;
        sampleMode      nearestPatchFace;
        sampleRegion    shell;
        samplePatch     shell_to_cap;
    }
)

// ************************************************************************* //
