artifacts/packs/lumped_solid_case_only_20260330_111000/lumped_solid/0/jellyRoll/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/jellyRoll";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    jellyRoll_to_shell
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    jellyRoll_to_cap
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
