artifacts/packs/lumped_solid_case_only_20260330_111000/lumped_solid/0/jellyRoll/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/jellyRoll";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
27144
(
0.01221881
0.012235493
0.012285336
0.012332102
0.01237062
0.01228084
0.012288377
0.012348622
...
)
;

boundaryField
{
    jellyRoll_to_cap
    {
        type            calculated;
        value           nonuniform List<scalar> 
1528
(
0.25003551
0.25000184
0.25000013
0.25000384
0.25001218
0.25000015
0.25000961
0.25000624
...
)
;
    }
    jellyRoll_to_shell
    {
        type            calculated;
        value           nonuniform List<scalar> 
9976
(
0.012328394
0.012349916
0.012159393
0.0099631684
0.012259375
0.009998663
0.01223239
0.0099999543
...
)
;
    }
}


// ************************************************************************* //
